of_cases/santaBreak/0.orig/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
8192
(
0.009125
0.009125
0.009125
0.009125
0.009125
0.009125
0.009125
0.009125
...
)
;

boundaryField
{
    backWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1024
(
0.146
0.146
0.146
0.146
0.146
0.146
0.146
0.146
...
)
;
    }
    frontWall
    {
        type            calculated;
        value           uniform 0;
    }
    leftWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
256
(
0.009125
0.009125
0.009125
0.009125
0.009125
0.009125
0.009125
0.009125
...
)
;
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
256
(
0.009125
0.009125
0.009125
0.009125
0.009125
0.009125
0.009125
0.009125
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
256
(
0.009125
0.027375
0.045625
0.063875
0.082125
0.100375
0.118625
0.136875
...
)
;
    }
    atmosphere
    {
        type            calculated;
        value           nonuniform List<scalar> 
256
(
0.009125
0.027375
0.045625
0.063875
0.082125
0.100375
0.118625
0.136875
...
)
;
    }
}


// ************************************************************************* //
